const Research = () => {
    return (
        <>
            <h1>นักศึกษาเลือกทำ สารนิพนธ์ เรื่องการศึกษาและเปรียบเทียบแพลตฟอร์มการจำลองประมวลผลควอนตัม</h1>
            <div>
                <p>
                ปัจจุบันมีความก้าวหน้าทางเทคโนโลยีมากข้ึนหน่ึงในน้ันคือเทคโนโลยีควอนตัม คอมพิวเตอร์ซึ่งอาจเป็นหน่ึงในเทคโนโลยีสำคัญในอนาคตทำให้มีการพัฒนาแพลตฟอร์มสาหรับ การประมวลผลควอนตัมหลายแพลตฟอร์ม ทำให้การเลือกใช้งานและศึกษาในแต่ละซอฟต์แวร์ ควอนตัมแพลตฟอร์มค่อนข้างยุ่งยากทำให้ผู้ใช้งานจำเป็นต้องใช้เวลากับการศึกษาและเลือกใช้ แพลตฟอร์มท่ีเหมาะสมและถูกต้อง
การศึกษาน้ีได้คัดเลือกซอฟต์แวร์ควอนตัมแพลตฟอร์มท่ีน่าสนใจมาท้ังหมด 4 แพลตฟอร์มนำมาทำการรวบรวมข้อมูลต่างๆ ภาพรวมระบบม การติดต้ัง, การใช้งาน ภาษาและรูปแบบการเขียน โปรแกรม การทดสอบฟังกช์ั่น และอลักอริทึมวา่สามารถใช้งานอะไรได้บ้าง และนำมาเปรียบเทียบ ภาพรวมการเพื่อคัดเลือก 2 แพลตฟอร์มที่เหมาะสมกับการใช้งาน โดยขั้นตอนสุดท้ายจะนำ 2 แพลตฟอร์มท่ีเลือกเอาไว้มาเปรียบเทียบประสิทธิภาพการทำงานแบบจำลองโดยใช้ Shor's algorithm
                </p>
                <div>
                <img src="https://scontent.fbkk2-3.fna.fbcdn.net/v/t39.30808-6/365255876_3642441425998568_3905317989098714612_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=730e14&_nc_eui2=AeHzZTOD7E4U_JI7EtRzbfUDFIr7R1GusoQUivtHUa6yhAwmhC6m9L-DxqS9JVGP36hHUA9jl1LGqdwCTYfXgvAD&_nc_ohc=vFo4R9tCz-wAX-3RAcT&_nc_ht=scontent.fbkk2-3.fna&oh=00_AfDlt6WDhE6ZKomQoY5Wc7WXvbf5fhap_VaxwBY5JPtEaA&oe=64D40DF2"/>
                </div>
            </div>
        </>
    )
}

export default Research